IdeaRS.Connections
BasePlateData.ShearForceTransfer Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the method of transfer of shear force to a foundation block
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ShearForceTransferMethods ShearForceTransfer { get; set; }
Property Value
Type: ShearForceTransferMethods
See Also
Reference
BasePlateData Class
IdeaRS.Connections.Data Namespace